# Task 2

## Task 1: Create DataFrame

* We have 5 students with 3 different scores.

In [34]:
import pandas as pd
grades_dict = {"Wally" : [87,63,42], "Sam" : [100,87,72], "Eva" : [80,87,90], "katie" : [96,95,100], "Bob" : [83,98,78]}
grades = pd.DataFrame(grades_dict)

grades

   Wally  Sam  Eva  katie  Bob
0     87  100   80     96   83
1     63   87   87     95   98
2     42   72   90    100   78

## Task 2: Custom Index

In [35]:
grades.index = ["Test1", "Test2", "Test3"]
grades["Eva"]

Test1    80
Test2    87
Test3    90
Name: Eva, dtype: int64

In [36]:
grades.Sam

Test1    100
Test2     87
Test3     72
Name: Sam, dtype: int64

## Task 3. Accessing Rows(loc, iloc)

In [37]:
grades.loc["Test1"]

Wally     87
Sam      100
Eva       80
katie     96
Bob       83
Name: Test1, dtype: int64

In [38]:
grades.iloc[2]

Wally     42
Sam       72
Eva       90
katie    100
Bob       78
Name: Test3, dtype: int64

In [39]:
grades.loc["Test1" : "Test3"]

       Wally  Sam  Eva  katie  Bob
Test1     87  100   80     96   83
Test2     63   87   87     95   98
Test3     42   72   90    100   78

## Task 3. Accessing Subsets

In [40]:
grades.at["Test2", "Eva"]

87

In [41]:
grades.iat[2,0]

42

## Task 4. Describe (By Column)

In [42]:
grades.describe()

       Wally     Sam    Eva   katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   64.00   86.33  85.67   97.00  86.33
std    22.52   14.01   5.13    2.65  10.41
min    42.00   72.00  80.00   95.00  78.00
25%    52.50   79.50  83.50   95.50  80.50
50%    63.00   87.00  87.00   96.00  83.00
75%    75.00   93.50  88.50   98.00  90.50
max    87.00  100.00  90.00  100.00  98.00

In [43]:
pd.set_option("display.precision", 2)
grades.describe()

       Wally     Sam    Eva   katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   64.00   86.33  85.67   97.00  86.33
std    22.52   14.01   5.13    2.65  10.41
min    42.00   72.00  80.00   95.00  78.00
25%    52.50   79.50  83.50   95.50  80.50
50%    63.00   87.00  87.00   96.00  83.00
75%    75.00   93.50  88.50   98.00  90.50
max    87.00  100.00  90.00  100.00  98.00

* When I used pd.set_options('precision'2), there was error. 
* After Web search it suggested me to use pd.set_option("display.precision", 2) and it ran sucessfully.

## Task 5 : Transpose (rows <-->) columns

In [44]:
grades.mean()

Wally    64.00
Sam      86.33
Eva      85.67
katie    97.00
Bob      86.33
dtype: float64

In [45]:
grades.T

       Test1  Test2  Test3
Wally     87     63     42
Sam      100     87     72
Eva       80     87     90
katie     96     95    100
Bob       83     98     78

In [46]:
grades.T.describe()

        Test1  Test2   Test3
count    5.00   5.00    5.00
mean    89.20  86.00   76.40
std      8.53  13.75   22.06
min     80.00  63.00   42.00
25%     83.00  87.00   72.00
50%     87.00  87.00   78.00
75%     96.00  95.00   90.00
max    100.00  98.00  100.00

## Task 6 : Sort

In [47]:
grades.sort_index(ascending=False)

       Wally  Sam  Eva  katie  Bob
Test3     42   72   90    100   78
Test2     63   87   87     95   98
Test1     87  100   80     96   83

In [48]:
grades.sort_index(axis=1)

       Bob  Eva  Sam  Wally  katie
Test1   83   80  100     87     96
Test2   98   87   87     63     95
Test3   78   90   72     42    100